# _*_coding:utf-8 _*_
# @Time　　 :2020/12/23/023   10:08
# @Author　 : Antipa
# @File　　 :program_type_mapping.py
# @Theme    :PyCharm

def get_mapping():
    """
    type:[program_feature_tup,package_feature_tup]
    :return:key=应用类型，value是由应用名称特征的元组与包名特征的元组的组成的列表
    """
    m={
        '漫画':[('漫','腐','耽美','异次元'),()],
        '交友':[('交友','约会','夜约','快约','约爱','秘约','寻爱','遇爱','相亲','附近','红娘','婚恋','单身','脱单','见面','聊天','蜜桃','香水','密聊','蜜聊','热聊','陌聊','播聊','探聊','探语','探探','猎聊','快聊','妹聊','闪聊','夜聊','陌陌','视频交友','秒见','佳缘','有缘','两性','缘分','婚恋','聊','语音','夜色','直播'),()],
        '区块链':[('币','挖矿','区块','XX链','比特','token'),('coin','chain','wallet','token')],
        '小说':[('小说','书城','搜书','追书','书客','阅读','阅','读'),('read',' reader',' novel',' book',' yuedu','xiaoshuo','literature')],
        '投资':[('理财','投资','贷','融','宝','普惠','财富','证券','股票'),('dai','credit','loan','financial','finance','c2c','economic','p2p')],
        '网赚':[('赚','兼职','红包','养'),('com.weizhuan','com.share.share','com.iyoyi.news','cn.laibiji','com.wyzpy','com.xpt','com.shuixin','com.lushi.zhuanbao','com.egee','com.longbok.kuplay','com.nook','com.tieniu.lezhuan','com.tongyi','com.videowallpaper.live','com.xyun','com.yc.wzx','com.youguo.wz')],
        '工具类_日历':[('日历','万年历','黄历','吉历','月历','算命','测算','周易','八字','生肖','风水','运势','运程','紫薇','面相','手相','起名','取名','解梦','星座','塔罗','占卜','罗盘'),('calendar','rili','wannianli','fengshui','compass','fortunetelling','qiming','tarot')],
        '工具类_清理':[('清理','杀毒','加速大师','内存','安全','卫士','手机管家','手助','优化大师','手机大师 '),('clean','calendar')],
        '工具类_锁屏&壁纸':[('锁屏','壁纸','桌宠'),()],
        '工具类_来电&铃声':[('来电','铃声'),()],
        '工具类_WiFi':[('WiFi','万能钥匙'),()],
        '工具类_输入法':[('输入法','输入'),()],
        '工具类_天气':[('天气'),()],
        '工具类_VPN': [('VPN', 'vpn'), ()],
        '工具类_定位':[('定位','地图'),()],
        '工具类_计算器':[('计算器'),()],
        '工具类_其他':[('剪辑','省电','p图','加速','修图','充电','解压','压缩','美图秀秀。日历','天气','词典翻译','计算器','遥控器','手电筒','指南针','时钟闹钟','文件传输','文件管理','壁纸铃声','截图录屏','录音'),()],
        '广告':[('广告'),()],
        '博彩&棋牌':[('葡京','彩神','金沙；棋牌','麻将','斗地主','扑克','雀神','彩票'),()],
        '视频':[('视频','影视','影音','TV','电视','視頻'),()],
        '新闻':[('头条','新闻'),()],
        '教育':[('学霸','小学','初中','高中','编程','教学','教育','作业','课堂','网校','辅导','课堂','升学','英语','化学','语文','数学','物理','四级','六级','家教','考试','职考','学习','培训','易学','考研'),()],
        '音乐':[('音乐'),()],
        '办公':[('办公','协同办公'),()],
        '浏览器':[('浏览器'),()],
        '网贷':[('分期','借条','借贷'),()]
    }

    return m
