# _*_coding:utf-8 _*_
# @Time　　 :2020/9/4/004   10:51
# @Author　 : 
#@ File　   :关键件匹配失败记录_test.py
#@ Desc     :

# 原始关键字列表
kw_list=[
'空气','加密猫','虚拟数字货币','榴莲','秘乐短视频','本色世界','趣步','泰木谷','惠农天下','雷达币','尚朋高科','ddt','众人聚','淘淘乐','抢抢乐','欢程汽车','云顶托管','帮呗','奥美','云集品','神域online','云联惠','ifa','九龙壁','美生在线','盘古帮','前天养龙','今天遛狗','明天养鱼','链易交易所','美盛e理财','中国梦币','ace','ipfs','ambc','合发全球','国网（人际网）','亚元','1040阳光工程','btck','魔术币','哥伦布区块链','国际鸿利大业','蚂蚁短视频','中国昌盛集团','ptc','旭日物眹','路捷股权','东望志愿者协会','jnb节能币','gdc环球','涡轮计划','esc全球环保','影粉世家','门头沟交易所','本色世界','皇家至尊','艾德卡','hoo','hoo','迈世勒','海底小纵队','华夏基金','cxc','octoken','十度广告','utoken','大圣天下','链拍拍','swipansfer','财创宝','尚朋高科','期管家','开心果园','比特矿场','比特黄金','grccoin','exodus','融商环球','bwb','sea','fca','淘画网','ves','缤纷果园','汇众','恒丰投资','aot','中富荣汇','蚂蚁赚','youbank','海底奇观','爱斯科特','eox','点购商城','萌菜乐园','亚交所','华通金融','百达金融','花仙奇缘','金满溢','c网交易所','智慧商圈','火星互联','ada','星球联盟','水果王国','区块牧牛','米酷商城','飞虎网','本草合约xcm','铁甲钢拳','mcfx','dcep','gec环保币','雷盾交易所','马里奥','喵喵','bitcoke交易所','mark交易所','dxd交易所','xoxoex交易所','bd币交易所',' pabala','云电创投理财','ubank交易所','翰奇科技','gaea交易平台','ai zhibiao交易所','bitcoin gold','mcka魔咖','drc数权公链','百利金plk','loex雷盾交易所','hkex交易所','yh互助','coinbig交易所','缘逗短视频','品推推商城','ooex交易所','ibc区块链','克比亚国际','西尔贝超级公链','coinx币次元','dgss','链信cct ','积木云','boxex交易所','贝邦国际','pw index社区','mex大通金融','星球国际','tg淘金网赚钱','bte理财','特斯拉交易所','gib环球投资数字银行','迈富通','晋商汇民','智能店铺','乐多点赞','伯硕','moliex','ellent外汇','axm公益链','btcv比特','优贝迪','honorglobal','前沿区块链','茉莉交易所','5g基建','dmmmbcs','中国红梅','中数信安','bdcc黄金公链','平通仪','醋蛋归元液','众亿网彩','短期期权','德鑫集团','中国梦圆梦计划','云联盟华云数字','大宗交易','疫情补贴','ep环保','华尔街股权','民生保障网','社保卡补贴','振兴东北老工业3260','十二卡','圆梦卡'
]

kw_match_failed=[]
with open(r'E:\antiy\NOTE_NEW\test\sss\kw_match.txt','r',encoding='utf-8') as f:
    kw_match=f.readlines()

for k in kw_list:
    flag=0
    for m in kw_match:
        if k in m.strip():
            flag=1
            break
    if flag==0:
        kw_match_failed.append(k)
for k in kw_match_failed:
    print(k)
print(len(kw_match_failed))


